## Data inspection of the real propecty sales file

File name: Real Property Sales <br> 
Location: Documents/Data Science/Fatiron School/week3/

## Step 1: Unziping the file

In [114]:
import numpy as np

In [72]:
## Using zipfile package, we unzip the raw data and place it in the same directory

import zipfile


zip_ref = zipfile.ZipFile('raw_data/Real Property Sales.zip', 'r')
zip_ref.extractall('raw_data/')
zip_ref.close()

zip_ref = zipfile.ZipFile('raw_data/Residential Building.zip', 'r')
zip_ref.extractall('raw_data/')
zip_ref.close()

## Step 2: Inspecting the files content

In [138]:
## Import pandas and inspect the content of the data using a DataFrame

import pandas as pd

sales_df = pd.read_csv('raw_data/EXTR_RPSale.csv')
sales_df.head()

/Users/Erica/anaconda3/envs/learn-env/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2785: DtypeWarning: Columns (1,2) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,ExciseTaxNbr,Major,Minor,DocumentDate,SalePrice,RecordingNbr,Volume,Page,PlatNbr,PlatType,...,PropertyType,PrincipalUse,SaleInstrument,AFForestLand,AFCurrentUseLand,AFNonProfitUse,AFHistoricProperty,SaleReason,PropertyClass,SaleWarning
0,2687551,138860,110,08/21/2014,245000,20140828001436,,,,,...,3,6,3,N,N,N,N,1,8,
1,1235111,664885,40,07/09/1991,0,199203161090,071,001,664885,C,...,3,0,26,N,N,N,N,18,3,11
2,2704079,423943,50,10/11/2014,0,20141205000558,,,,,...,3,6,15,N,N,N,N,18,8,18 31 51
3,2584094,403700,715,01/04/2013,0,20130110000910,,,,,...,3,6,15,N,N,N,N,11,8,18 31 38
4,1056831,951120,900,04/20/1989,85000,198904260448,117,053,951120,P,...,3,0,2,N,N,N,N,1,9,49

In [139]:
bldg_df = pd.read_csv('raw_data/EXTR_ResBldg.csv')
bldg_df.head()

/Users/Erica/anaconda3/envs/learn-env/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2785: DtypeWarning: Columns (11) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,Major,Minor,BldgNbr,NbrLivingUnits,Address,BuildingNumber,Fraction,DirectionPrefix,StreetName,StreetType,...,FpMultiStory,FpFreestanding,FpAdditional,YrBuilt,YrRenovated,PcntComplete,Obsolescence,PcntNetCondition,Condition,AddnlCost
0,520,67,1,1,6781 MARS AVE S 98108,6781,,,MARS,AVE,...,1,0,1,1940,2014,0,0,0,3,0
1,640,7,1,1,45216 196TH AVE SE 98022,45216,,,196TH,AVE,...,1,0,0,1961,0,0,0,0,4,0
2,640,16,1,1,20410 SE 456TH WAY 98022,20410,,SE,456TH,WAY,...,0,0,0,2004,0,0,0,0,3,0
3,660,96,1,1,8501 S 259TH ST 98030,8501,,S,259TH,ST,...,0,0,0,1933,0,0,0,0,4,0
4,720,13,1,1,84 LOGAN AVE S 98055,84,,,LOGAN,AVE,...,0,0,0,1924,0,0,0,0,3,0

In [75]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2033420 entries, 0 to 2033419
Data columns (total 24 columns):
ExciseTaxNbr          int64
Major                 object
Minor                 object
DocumentDate          object
SalePrice             int64
RecordingNbr          object
Volume                object
Page                  object
PlatNbr               object
PlatType              object
PlatLot               object
PlatBlock             object
SellerName            object
BuyerName             object
PropertyType          int64
PrincipalUse          int64
SaleInstrument        int64
AFForestLand          object
AFCurrentUseLand      object
AFNonProfitUse        object
AFHistoricProperty    object
SaleReason            int64
PropertyClass         int64
SaleWarning           object
dtypes: int64(7), object(17)
memory usage: 372.3+ MB

In [76]:
bldg_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 512548 entries, 0 to 512547
Data columns (total 50 columns):
Major                 512548 non-null int64
Minor                 512548 non-null int64
BldgNbr               512548 non-null int64
NbrLivingUnits        512548 non-null int64
Address               512548 non-null object
BuildingNumber        512548 non-null object
Fraction              512548 non-null object
DirectionPrefix       511984 non-null object
StreetName            512548 non-null object
StreetType            512548 non-null object
DirectionSuffix       511984 non-null object
ZipCode               468452 non-null object
Stories               512548 non-null float64
BldgGrade             512548 non-null int64
BldgGradeVar          512548 non-null int64
SqFt1stFloor          512548 non-null int64
SqFtHalfFloor         512548 non-null int64
SqFt2ndFloor          512548 non-null int64
SqFtUpperFloor        512548 non-null int64
SqFtUnfinFull         512548 non-null int64
SqFtUnfinHalf         512548 non-null int64
SqFtTotLiving         512548 non-null int64
SqFtTotBasement       512548 non-null int64
SqFtFinBasement       512548 non-null int64
FinBasementGrade      512548 non-null int64
SqFtGarageBasement    512548 non-null int64
SqFtGarageAttached    512548 non-null int64
DaylightBasement      512548 non-null object
SqFtOpenPorch         512548 non-null int64
SqFtEnclosedPorch     512548 non-null int64
SqFtDeck              512548 non-null int64
HeatSystem            512548 non-null int64
HeatSource            512548 non-null int64
BrickStone            512548 non-null int64
ViewUtilization       512548 non-null object
Bedrooms              512548 non-null int64
BathHalfCount         512548 non-null int64
Bath3qtrCount         512548 non-null int64
BathFullCount         512548 non-null int64
FpSingleStory         512548 non-null int64
FpMultiStory          512548 non-null int64
FpFreestanding        512548 non-null int64
FpAdditional          512548 non-null int64
YrBuilt               512548 non-null int64
YrRenovated           512548 non-null int64
PcntComplete          512548 non-null int64
Obsolescence          512548 non-null int64
PcntNetCondition      512548 non-null int64
Condition             512548 non-null int64
AddnlCost             512548 non-null int64
dtypes: float64(1), int64(39), object(10)
memory usage: 195.5+ MB

## step 3: Reducing the dataframe to include the relevant factors

In [140]:
sales_df = sales_df[['Major', 'Minor', 'SalePrice', 'DocumentDate', 'PrincipalUse']]
sales_df.head()

    Major Minor  SalePrice DocumentDate  PrincipalUse
0  138860   110     245000   08/21/2014             6
1  664885    40          0   07/09/1991             0
2  423943    50          0   10/11/2014             6
3  403700   715          0   01/04/2013             6
4  951120   900      85000   04/20/1989             0

In [141]:
bldg_df = bldg_df[['Major', 'Minor', 'ZipCode', 'BldgGrade', 'SqFtTotLiving', 'Bedrooms', 'BathHalfCount', 
                   'Bath3qtrCount', 'BathFullCount', 'YrBuilt', 'YrRenovated']]
bldg_df.head()

,Major,Minor,ZipCode,BldgGrade,SqFtTotLiving,Bedrooms,BathHalfCount,Bath3qtrCount,BathFullCount,YrBuilt,YrRenovated
0,520,67,98108,7,2360,3,0,1,2,1940,2014
1,640,7,98022,6,1770,3,1,0,1,1961,0
2,640,16,98022,9,2720,3,1,0,3,2004,0
3,660,96,98030,7,1360,4,0,0,1,1933,0
4,720,13,98055,6,1270,3,0,0,1,1924,0

## step 4: merge two files

In [142]:
sales_df['Major'] = pd.to_numeric(sales_df['Major'], errors='coerce')

In [143]:
sales_df['Minor'] = pd.to_numeric(sales_df['Minor'], errors='coerce')

In [144]:
sales_data = pd.merge(sales_df, bldg_df, on=['Major', 'Minor'])

In [145]:
sales_data.head().T

                        0           1           2           3           4
Major              138860      138860      138860      138860      423943
Minor                 110         110         110         110          50
SalePrice          245000      109300       14684           0           0
DocumentDate   08/21/2014  06/12/1989  01/16/2005  06/08/2005  10/11/2014
PrincipalUse            6           0           6           0           6
ZipCode             98002       98002       98002       98002       98092
BldgGrade               7           7           7           7           6
SqFtTotLiving        1490        1490        1490        1490         960
Bedrooms                3           3           3           3           3
BathHalfCount           0           0           0           0           0
Bath3qtrCount           0           0           0           0           0
BathFullCount           2           2           2           2           1
YrBuilt              1989        1989        1989        1989        1969
YrRenovated             0           0           0           0           0

## step 5: data cleaning

In [146]:
sales_data.isna().any()

Major            False
Minor            False
SalePrice        False
DocumentDate     False
PrincipalUse     False
ZipCode           True
BldgGrade        False
SqFtTotLiving    False
Bedrooms         False
BathHalfCount    False
Bath3qtrCount    False
BathFullCount    False
YrBuilt          False
YrRenovated      False
dtype: bool

In [147]:
sales_data.isna().sum()

Major                 0
Minor                 0
SalePrice             0
DocumentDate          0
PrincipalUse          0
ZipCode          118382
BldgGrade             0
SqFtTotLiving         0
Bedrooms              0
BathHalfCount         0
Bath3qtrCount         0
BathFullCount         0
YrBuilt               0
YrRenovated           0
dtype: int64

In [148]:
print(len(sales_data[sales_data['ZipCode'] == 'A']))
print(len(sales_data[sales_data['ZipCode'] == 'B']))
print(len(sales_data[sales_data['ZipCode'] == 'WA']))
print(len(sales_data[sales_data['ZipCode'] == '0']))

3
1
3
1

Given the fact there are categorical data, we are replacing the values to null

In [119]:
#sales_data.loc[(sales_data.ZipCode == 'A')
#               |(sales_data.ZipCode == '0')
#               |(sales_data.ZipCode == 'B')
#               |(sales_data.ZipCode == 'WA'),
#               'ZipCode'] = np.nan 

#delete
#sales_data.drop(sales_data[sales_data['ZipCode'] == 'A'].index, axis =0, inplace=True)
#sales_data.drop(sales_data[sales_data['ZipCode'] == 'B'].index, axis =0, inplace=True)
#sales_data.drop(sales_data[sales_data['ZipCode'] == 'WA'].index, axis =0, inplace=True)
#sales_data.drop(sales_data[sales_data['ZipCode'] == '0'].index, axis =0, inplace=True)

In [149]:
print(len(sales_data[sales_data['SalePrice'] == 0]))

492733

In [150]:
def clean_zips(x):
    x = str(x)
    if len(x) >= 5:
        x = x[:5]
        return int(x)
    else:
        return np.nan

sales_data['ZipCode'] = sales_data['ZipCode'].apply(clean_zips)

sales_data.head()

,Major,Minor,SalePrice,DocumentDate,PrincipalUse,ZipCode,BldgGrade,SqFtTotLiving,Bedrooms,BathHalfCount,Bath3qtrCount,BathFullCount,YrBuilt,YrRenovated
0,138860.0,110.0,245000,08/21/2014,6,98002.0,7,1490,3,0,0,2,1989,0
1,138860.0,110.0,109300,06/12/1989,0,98002.0,7,1490,3,0,0,2,1989,0
2,138860.0,110.0,14684,01/16/2005,6,98002.0,7,1490,3,0,0,2,1989,0
3,138860.0,110.0,0,06/08/2005,0,98002.0,7,1490,3,0,0,2,1989,0
4,423943.0,50.0,0,10/11/2014,6,98092.0,6,960,3,0,0,1,1969,0

In [151]:
sales_data['ZipCode'].isna().sum()

118414

Given that 8.15% of the dataset contains missing values, we're keeping the null values in the dataset

In [152]:
sales_data['ZipCode'].value_counts().head()

98042.0    40315
98115.0    37193
98023.0    36777
98038.0    33043
98034.0    32376
Name: ZipCode, dtype: int64

dropping all the rows that sale price = 0

In [153]:
sales_data = sales_data.loc[~(sales_data['SalePrice'] <=0), :]

In [154]:
sales_data = sales_data.loc[~(sales_data['SqFtTotLiving'] ==0), :]

we're only including the rows that have the principle use as 0,2,4,6,8

In [156]:
a = [0,2,4,6,8]
sales_data = sales_data[sales_data['PrincipalUse'].isin(a)]

In [157]:
sales_data.head()

,Major,Minor,SalePrice,DocumentDate,PrincipalUse,ZipCode,BldgGrade,SqFtTotLiving,Bedrooms,BathHalfCount,Bath3qtrCount,BathFullCount,YrBuilt,YrRenovated
0,138860.0,110.0,245000,08/21/2014,6,98002.0,7,1490,3,0,0,2,1989,0
1,138860.0,110.0,109300,06/12/1989,0,98002.0,7,1490,3,0,0,2,1989,0
2,138860.0,110.0,14684,01/16/2005,6,98002.0,7,1490,3,0,0,2,1989,0
6,423943.0,50.0,96000,07/15/1999,6,98092.0,6,960,3,0,0,1,1969,0
7,423943.0,50.0,127500,01/08/2001,6,98092.0,6,960,3,0,0,1,1969,0

In [158]:
sales_data.drop(columns=['BathHalfCount'], axis=1, inplace=True)

In [159]:
sales_data.drop(columns=['Bath3qtrCount'], axis=1, inplace=True)

In [160]:
sales_data.head()

,Major,Minor,SalePrice,DocumentDate,PrincipalUse,ZipCode,BldgGrade,SqFtTotLiving,Bedrooms,BathFullCount,YrBuilt,YrRenovated
0,138860.0,110.0,245000,08/21/2014,6,98002.0,7,1490,3,2,1989,0
1,138860.0,110.0,109300,06/12/1989,0,98002.0,7,1490,3,2,1989,0
2,138860.0,110.0,14684,01/16/2005,6,98002.0,7,1490,3,2,1989,0
6,423943.0,50.0,96000,07/15/1999,6,98092.0,6,960,3,1,1969,0
7,423943.0,50.0,127500,01/08/2001,6,98092.0,6,960,3,1,1969,0

create a new column for the year, where we take the year renovated(of the ones have the value) and year built as the value

In [162]:
sales_data['DocumentDate'] = sales_data['DocumentDate'].apply(pd.Timestamp)

In [164]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 955514 entries, 0 to 1451790
Data columns (total 12 columns):
Major            955514 non-null float64
Minor            955514 non-null float64
SalePrice        955514 non-null int64
DocumentDate     955514 non-null datetime64[ns]
PrincipalUse     955514 non-null int64
ZipCode          872506 non-null float64
BldgGrade        955514 non-null int64
SqFtTotLiving    955514 non-null int64
Bedrooms         955514 non-null int64
BathFullCount    955514 non-null int64
YrBuilt          955514 non-null int64
YrRenovated      955514 non-null int64
dtypes: datetime64[ns](1), float64(3), int64(8)
memory usage: 94.8 MB

In [165]:
sales_data['Year'] = sales_data['DocumentDate'].apply(lambda ts:ts.year)